In [1]:
import sqlite3

In [2]:
con = sqlite3.connect("students.db")

In [3]:
cur = con.cursor()

In [7]:
CREATE_TABLE_QUERY = """

create table student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null
);

"""
cur.execute(CREATE_TABLE_QUERY)

OperationalError: table student already exists

In [5]:
INSERT_RECORDS = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
values
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f','CE');

"""
cur.execute(INSERT_RECORDS)

In [6]:
con.commit()

In [9]:
all_student = cur.execute("SELECT * FROM student;")
for student in all_student:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE')

In [10]:
for student in all_student:
    print(student)

In [11]:
all_student = cur.execute("SELECT name, address FROM student;")
for student in all_student:
    print(student)

('ram', 'kathmandu')
('shyam', 'lalitpur')
('gita', 'pokhara')
('sita', 'kathmandu')

In [12]:
cur.execute("UPDATE student set address = 'lalitpur' where id = 3;")

In [23]:
all_student = cur.execute("SELECT * FROM student;")
for student in all_student:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '93123123', 'ram@gmail.com')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU', '9213123123', 'shyam@gmail.com')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE', 'TU', '9212123123', 'gita@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'TU', '9212123123', 'sita@gmail.com')

In [14]:
cur.execute("ALTER table student add university default 'TU';")
cur.execute("ALTER table student add contact varchar(20);")
cur.execute("ALTER table student add email varchar(20);")

In [19]:
cur.execute("""

UPDATE student set contact = '93123123', email = "ram@gmail.com"
where id = 1;

""")

In [20]:
cur.execute("""

UPDATE student set contact = '9213123123', email = "shyam@gmail.com"
where id = 2;

""")

In [21]:
cur.execute("""

UPDATE student set contact = '9212123123', email = "gita@gmail.com"
where id = 3;

""")

In [22]:
cur.execute("""

UPDATE student set contact = '9212123123', email = "sita@gmail.com"
where id = 4;

""")

In [26]:
address = input("Enter the address: ")

all_student = cur.execute(f"SELECT * FROM student \
where address='{address}';")
for student in all_student:
    print(student)

Enter the address: kathmandu
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '93123123', 'ram@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'TU', '9212123123', 'sita@gmail.com')

In [29]:
address = input("Enter the address: ")

all_student = cur.execute(f"SELECT * FROM student \
where address='{address}';")
for student in all_student:
    print(student)

Enter the address: lalitpur' or address = 'kathmandu
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU', '93123123', 'ram@gmail.com')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU', '9213123123', 'shyam@gmail.com')
(3, 'gita', 'lalitpur', 'ncit', 21, 'f', 'SE', 'TU', '9212123123', 'gita@gmail.com')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'TU', '9212123123', 'sita@gmail.com')

In [30]:
# SELECT * FROM student where address='lalitpur' or address = 'kathmandu'

In [32]:
address = input("Enter the address: ")

all_student = cur.execute(f"SELECT * FROM student \
where address=?;", (address,))
for student in all_student:
    print(student)

Enter the address: lalitpur' or address = 'kathmandu

In [35]:
students = [
    (5, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', "PU", '9823432', 'hari@gmail.com'),
    (6, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'UK', "BIT", '982343322', 'madan.bahadur@gmail.com'),
    (7, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'SE', "PU", '9823423232', 'maya.devi@gmail.com'),
]

In [36]:
INSERT_STUDENT_QUERY = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
values
(?, ?, ?, ?, ?, ?, ?, ?, ?, ?),

"""

cur.executemany(INSERT_STUDENT_QUERY, students)

OperationalError: incomplete input